a-container-for-my-dbs/pgsql-docker-net-1.out
sysbench --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=1 --time=1200 run --tables=1 --table-size=10000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5632634
        write:                           1609324
        other:                           804662
        total:                           8046620
    transactions:                        402331 (335.27 per sec.)
    queries:                             8046620 (6705.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0023s
    total number of events:              402331

Latency (ms):
         min:                                    2.03
         avg:                                    2.98
         max:                                  431.19
         95th percentile:                        3.82
         sum:                              1199081.53

Threads fairness:
    events (avg/stddev):           402331.0000/0.00
    execution time (avg/stddev):   1199.0815/0.00

sysbench --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=1 --time=1200 run --tables=1 --table-size=10000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5876122
        write:                           1678892
        other:                           839446
        total:                           8394460
    transactions:                        419723 (349.77 per sec.)
    queries:                             8394460 (6995.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0028s
    total number of events:              419723

Latency (ms):
         min:                                    1.99
         avg:                                    2.86
         max:                                  430.37
         95th percentile:                        3.36
         sum:                              1199015.67

Threads fairness:
    events (avg/stddev):           419723.0000/0.00
    execution time (avg/stddev):   1199.0157/0.00

sysbench --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=1 --time=1200 run --tables=1 --table-size=10000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5898998
        write:                           1685428
        other:                           842714
        total:                           8427140
    transactions:                        421357 (351.13 per sec.)
    queries:                             8427140 (7022.60 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0008s
    total number of events:              421357

Latency (ms):
         min:                                    1.95
         avg:                                    2.85
         max:                                  412.81
         95th percentile:                        3.36
         sum:                              1199015.82

Threads fairness:
    events (avg/stddev):           421357.0000/0.00
    execution time (avg/stddev):   1199.0158/0.00